package spring01Junttest;

import org.junit.Test;

public class Spring01JunitTest {
    //单元测试 ， 在公司中，自已先测试完毕，请队友问问题的时候 一定要说，我的junit 测试没通过啊 有bug 帮我看看
    @Test
    public void test01(){
        System.out.println(" 我是单元测试，在公司中 单元测试 是java程序员 的自已的，必须的测试，用来测试的"+
                "dao层，controller层，是否能正常运行"+
                "2.单元测试的写法，必须是 @Test 注解来自于 org.junit.Test 这个包，必须是void静态  没有返回值的方法"+
                "3.方法名称  和类名  最好不可以 起 test()  Test.java"+
                "4. 单元测试  是用来  代替 main方法测试，main 方法测试有一定的局限性，例如：无法 测试 web项目，比如：项目request 等");
    }

    //反射：是 在jvm 虚拟机的类加载中  .java------------> class文件 在这个转换期间
    // jvm 可以看到  类的所有的信息，比如 属性，方法，父类，接口等
    // 即：反射  对于任意一个对象  都能够调用它的  任意方法 和属性
    //这样的动态获取信息以及动态调用对象的方法的功能  叫做 java的反射机构，不是我们通俗讲的  镜面反射光线的反射
    // 为什么要学反射？？  因为反射就是 Spring框架的底层实现
    // 为什么 Spring 框架要用到反射，因为 反射 可以 解耦合
    // 什么是解耦        解耦就是 接触程序之间的耦合
    //什么是耦合    耦合就是程序之间 过于依赖了
    //什么叫做依赖   依赖就是 A 程序调用B程序，A程序中有B的方法调用




}
